"""
Вспомогательные функции для модуля services
"""


def sizeof_fmt(num: int, suffix: str = "B"):
    """
    Функция для перевода размера из целого значения в строку

    Принимает:
        num: размер изображения,
        suffix: единица размера:
            "B"-байты,
            "Ki"-килобайты,
            "Mi"-мегабайты,
            "Gi"-гигабайты,
            "Ti"-терабайты

    Возвращает строку, представляющую размер
    """
    for unit in ["", "Ki", "Mi", "Gi", "Ti", "Pi", "Ei", "Zi"]:
        if abs(num) < 1024.0:
            return f"{num:4f}{unit}{suffix}"
        num /= 1024.0
    return f"{num:.3f}Yi{suffix}"
